Repository: khanhtrinh301103/Math-Game
Catalog: Math Game/*.lproj/Localizable.strings
Languages: vi

source: Choose a Difficulty Level
vi: Chọn một Mức Độ Khó

source: In the settings, select your preferred difficulty level: Easy, Medium, or Hard
vi: Trong cài đặt, chọn mức độ khó ưa thích của bạn: Dễ, Trung bình hoặc Khó

source: Start the Game
vi: Bắt đầu Trò Chơi

source: After selecting a difficulty level, tap Save button to save the level of difficulty then tap let's play to begin.
vi: Sau khi chọn mức độ khó, nhấn nút Lưu để lưu mức độ khó sau đó nhấn vào Let's Play để bắt đầu.

source: Answer the Questions and saved score
vi: Trả lời các câu hỏi và lưu điểm số

source: You will be presented with math questions based on your chosen difficulty. Tap the correct answer to earn score, you have 10 seconds for each question. When you save the score, this game will encourage you by a winning screen and notify that your score is saved successfully, you can check the save score by tapping the button view saved scores
vi: Bạn sẽ được đặt trước trước các câu hỏi toán học dựa trên mức độ khó bạn đã chọn. Nhấn vào câu trả lời đúng để kiếm điểm, bạn có 10 giây cho mỗi câu hỏi. Khi bạn lưu điểm số, trò chơi này sẽ động viên bạn bằng một màn hình thắng cuộc và thông báo rằng điểm của bạn đã được lưu thành công, bạn có thể kiểm tra điểm đã lưu bằng cách nhấn vào nút Xem Điểm Đã Lưu

source: Game Over view
vi: Màn hình Kết Thúc Trò Chơi

source: When your score is below 0 or the time is up, the game will be overed
vi: Khi điểm số của bạn dưới 0 hoặc thời gian đã hết, trò chơi sẽ kết thúc

source: Score:
vi: Điểm:

source: Time Remaining:
vi: Thời Gian Còn Lại:

source: Save Score
vi: Lưu Điểm Số

source: View Saved Scores
vi: Xem Điểm Đã Lưu

source: Return
vi: Quay Lại

source: Enter Your Username:
vi: Nhập Tên Người Dùng Của Bạn:

source: Username
vi: Tên Người Dùng

source: Start Game
vi: Bắt Đầu Trò Chơi

source: Congratulations!
vi: Chúc Mừng!

source: You Won the Game!
vi: Bạn Đã Chiến Thắng Trò Chơi!

source: Your score is saved successfully
vi: Điểm của bạn đã được lưu thành công

source: Close
vi: Đóng

source: Select Difficulty Level
vi: Chọn Mức Độ Khó

source: Easy: Addition
vi: Dễ: Phép Cộng

source: Medium: Multiplication
vi: Trung bình: Phép Nhân

source: Hard: Addition and Division
vi: Khó: Phép Cộng và Phép Chia

source: Save
vi: Lưu

source: Game Over
vi: Kết Thúc Trò Chơi

source: Play Again
vi: Chơi Lại

source: Let's Play ▶︎
vi: Bắt Đầu Chơi ▶︎

source: How to Play 💡
vi: Cách Chơi 💡

source: Settings ⚙️
vi: Cài Đặt ⚙️

source: Leaderboard
vi: Bảng Xếp Hạng
